# 1. Дан список списков [[2, 4, 6], [8, 10, 12], [14, 16, 18]].
# Проверьте, все ли подсписки содержат только четные числа.
# a = [[2, 4, 6], [8, 10, 12], [14, 16, 18]]
# d = []
# for i in a:
#     for j in i:
#         if j%2 == 0:
#             d.append(True)
#         else:
#             d.append(False)
# print(all(d))

# 3.Создайте матрицу 4x4, заполненную числами от 1 до 16.
# matrix = [[i*4 + j + 1 for j in range(4)] for i in range(4)]
# print(matrix)
# for row in matrix:
#     print(row)
# 4.Дан список списков [[1, 2, 3], [4, 5, 6], [7, 8, 9]].
# Создайте одномерный список, содержащий все элементы из вложенных списков.
# a = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
# b = [i for row in a for i in row]
# print(b)

# # 5.Даны два списка:
# names = ['Alice', 'Bob', 'Charlie']
# ages = [25, 30, 35]
# # Создайте словарь, где ключи - имена, значения - возраста.
# dicti = {name  : age for age in ages for name in names}
# print(dicti)

# 6.Дан список чисел [1, 2, 21, 37, 4, 42, 42, 5, 59, 6, 6, 7, 82, 94, 9, 10].
# Создайте множество уникальных нечетных чисел из этого списка.
# a = [1, 2, 21, 37, 4, 42, 42, 5, 59, 6, 6, 7, 82, 94, 9, 10]
# d = {x for x in a if x % 2 == 0}
# print(d)