# 1.
# Напишите функцию, которая принимает натуральное число и возвращает его факториал (используя цикл!).



# 2.
# Напишите функцию number_to_digits(n), которая принимает натуральное число и возвращает список его цифр.



# 3.
# Напишите функцию is_prime(n), которая принимает целое число и возвращает
# True для простых чисел или False для чисел, не являющихся простыми.



# 4.
# Напишите функцию camel_to_snake(s), которая принимает строку в
# «верблюжьем регистре» (ThisIsCamelCased) и преобразует ее в «змеиный регистр» (this_is_camel_cased)
# a="heLLLo"
# b=""
# for i in range(len(a)):
#     if a[i].isupper():
#         b+="_"+a[i]
#     else:
#         b+=a[i]
#
# print(b.lower())